Autodesk.Revit.DB.FamilyInstance
This object represents a single instance of a family type, such as a single I beam.
Remarks: Examples of FamilyInstance objects within Autodesk Revit are Beams, Columns,
Braces and Desks. The FamilyInstance object provides more detailed properties that
enable the type of the family instance to be changed, thus changing their appearance
within the project.